src/Catalogs/Посылки/Посылки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Посылки</name>
  <attributes>
    <name>Участник</name>
    <type>
      <types>CatalogRef.Участники</types>
    </type>
  </attributes>
  <attributes>
    <name>ПерваяТочка</name>
    <type>
      <types>CatalogRef.ТочкиРаздачи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПунктВыдачи</name>
    <type>
      <types>CatalogRef.ТочкиРаздачи</types>
    </type>
  </attributes>
  <attributes>
    <name>Покупка</name>
    <type>
      <types>DefinedType.ТипыЗаказа</types>
    </type>
  </attributes>
  <attributes>
    <name>Догрузить</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗагрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>secureCode</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШК</name>
    <type>
      <types>CatalogRef.Мегаордера</types>
    </type>
  </attributes>
  <attributes>
    <name>Организатор</name>
    <type>
      <types>CatalogRef.Организаторы</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Перезаполнить</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>БесплатнаяВыдача</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>Покупка</name>
      <type>
        <types>DefinedType.ТипыЗаказа</types>
      </type>
    </attributes>
    <attributes>
      <name>Участник</name>
      <type>
        <types>CatalogRef.Участники</types>
      </type>
    </attributes>
    <attributes>
      <name>ШК</name>
      <type>
        <types>CatalogRef.Мегаордера</types>
      </type>
    </attributes>
    <attributes>
      <name>КодЗаказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/Посылки/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	Если Состав.Количество()	> 0 Тогда
		стрСостав	= Состав[0];
		Участник 	= стрСостав.Участник;
		Покупка  	= стрСостав.Покупка;
		Если ТипЗнч(стрСостав.Покупка)	<>	Тип("СправочникСсылка.Пристрой") 	Тогда 
			Организатор 				= СП_РаботаСоСправочниками.ПолучитьОрганизатораПо_Коду(?(ТипЗнч(стрСостав.Покупка)=Тип("СправочникСсылка.Покупки"),стрСостав.Покупка.Владелец.Код,стрСостав.Покупка.Организатор.Код));
			НаименованиеПристрой			=	"";	
		Иначе	
			НаименованиеПристрой			=	" пристрой";
		Конецесли;
	КонецЕсли;
	НаименованиеПосылки		= 	?(ЗначениеЗаполнено(Покупка),	Покупка.Наименование,"");
	
	Если ЗначениеЗаполнено(Покупка) Тогда
		Перезаполнить 		= Покупка.Догрузить;
		Догрузить			= Ложь;
	Иначе
		Перезаполнить 		= Истина;
		Догрузить			= Истина;
	КонецЕсли;	
	Наименование 			= "П ("+Формат(Код,"ЧГ=0")+") "+ НаименованиеПосылки;
КонецПроцедуры
